<template>
    <div class="user-agreement" ref="agreement"  @scroll="handleScroll($event)">
            <h3 class="t-c">中国建设银行企业智能撮合综合服务平台会员服务协议</h3>
            <div>

                <p>第一章  术语及释义</p>



                <p> 第一条 如无特别说明，下列用语在本协议中的含义为：

                    建设银行：指中国建设银行股份有限公司。

                    平台：即建设银行企业智能撮合综合服务平台,该平台是建设银行通过企业智能撮合综合服务平台网站和手机客户端（APP）为客户提供信息发布、商机推荐、需求撮合等服务的综合服务平台。

                    会员：希望通过平台发布需求、获取商机，提升经营效率的企事业法人或其他组织，在平台网站或手机客户端（APP）通过必要的注册程序后即成为平台会员。平台会员授权相关人员申请管理员与操作员岗位，平台会员应保证管理员、操作员已知悉并接受本协议所有内容。管理员和操作员的任何行为均视为平台会员行为。

                </p>
                <p>第二章  协议的组成及签署</p>


                <p>
                    第二条 本协议内容包括协议正文及所有建设银行已经发布的或将来可能发布（或修改）的有关平台的各类规则、法律声明（以下简称“规则”）。所有规则为本协议不可分割的组成部分，与协议正文具有同等法律效力。

                    上述规则包括但不限于建设银行通过以下方式发布或告知会员的规则：通过平台或其他渠道发布公告、通知、声明；网页上出现的关于操作的提示说明；发送给会员的信息（通过向会员预留手机发送短信或通过电话语音形式发送）等。
                </p>
                <p>
                    第三条 在办理平台会员注册程序或使用平台服务时，当事人应当是具备完全民事权利能力和完全民事行为能力的自然人、法人或其他组织，并符合建设银行规定的其他会员注册或使用平台服务的条件（简称“符合条件的申请人”）。如果当事人不符合上述约定，当事人应立即停止注册程序或停止使用平台服务，当事人不停止注册程序或不停止使用平台服务的，建设银行有权终止其注册程序及平台服务。
                </p>
                <p>
                    第四条 符合条件的申请人在注册或使用平台之前，应仔细阅读本协议全部内容，并特别注意字体加黑的条款。符合条件的申请人确认同意（包括但不限于点击注册页面下方的“同意”按钮等方式）本协议并完成注册流程后，即表示符合条件的申请人已成为平台会员，同时协议在建设银行和会员之间生效，会员承诺接受并遵守协议约定。如果会员不同意协议或其中任何条款约定，则应立即停止注册程序并停止使用平台服务。
                </p>
                <p>

                    第五条 建设银行有权依据法律、法规、规章或业务需要对本协议及各类规则等内容进行调整或修改，涉及收费或会员权利义务变更的，将正式对外公告一定时期后执行并适用于本协议，无需另行通知会员。如有需要，建设银行将在公告前报经有关金融监管部门核准或备案；会员有权在建设银行公告期间选择是否继续使用相关服务，如果会员不愿接受建设银行公告内容，应在建设银行公告施行前申请变更或终止相关服务；如果会员未申请变更或终止相关服务，视为会员同意相关调整，变更后的内容对会员产生法律约束力，若会员不执行变更后的内容，建设银行有权选择终止平台服务并行使本协议约定的其他权利。
                </p>



                <p>第三章  会员的主要权利及义务</p>



                <p>
                    第六条 会员授权用户在注册登录时采取实名制，可自行设定密码，会员有义务在注册时提供《授权委托书》（详见附件），并配合提供我行需要的其他完整、真实、准确、有效、合法的信息及相关资料，并保证该信息及资料内容的持续完整性、真实性、准确性、有效性及合法性，并同意建设银行通过必要方式对其身份和资质进行审核。会员的信息及相关资料发生变更时，会员有义务及时在平台更新有关注册资料。因会员的信息或相关资料不完整、不真实、不准确、失效或违法而导致平台无法提供服务或提供服务时发生任何错误，由此产生的全部法律后果由会员承担，因此给建设银行或其他第三方造成损失的，会员应予以赔偿。
                </p>
                <p>
                    第七条 会员通过平台网站或手机客户端（APP）注册为会员以后，有权使用自己的登录名及密码登录平台。会员应妥善保管自己的登录名及密码，避免以不安全的方式或在不安全的环境下使用密码，切勿将密码以任何形式透露给任何他人，或以易被他人发现、获得、盗用的方式保管。
                </p>
                <p>
                    第八条 会员的登录名、密码遭到未经授权的使用或发生其他任何安全问题，会员应立即通知建设银行。会员理解建设银行对会员的任何请求采取行动均需要合理时间，且建设银行应会员请求而采取的行动可能无法避免或阻止侵害后果的形成或扩大，除建设银行存在法定过错外，建设银行不承担责任。
                </p>
                <p>
                    第九条 会员设置的登录名不得违反国家法律法规及平台的相应管理规定，且不得侵犯或涉嫌侵犯他人合法权益，否则建设银行可回收会员的登录名，并按平台规则进行相应处理。
                </p>
                <p>
                    第十条 会员连续12个月未使用其登录名和密码登录平台，建设银行有权终止向会员提供平台服务，注销会员账户。账户注销后，相应的登录名将开放给任意用户注册登记使用。
                </p>
                <p>
                    第十一条 会员应对使用其登录名以及密码而从事的所有行为（包括但不限于在线签署各类协议、发布需求信息等）承担法律责任。会员不得以任何形式转让、出租或授权他人使用自己的注册信息（包括但不限于会员登录名及密码），会员违反该规定而引起的一切后果均由会员自行承担责任，因此给建设银行或其他第三方造成损失的，会员应予以赔偿。
                </p>
                <p>
                    第十二条 会员办理平台业务应直接通过平台网址或建设银行互联网网站（www.ccb.com）及正规应用商店下载的客户端登录，不应通过未经建设银行认可的邮件或其他网站提供的链接及非官方渠道下载的软件登录。
                </p>
                <p>
                    第十三条 会员承诺其在使用平台服务时的所有行为遵守国家法律、法规以及建设银行相关规则并符合社会公共利益和公共道德。会员应对其在平台或平台服务中传输、发布的所有信息内容全部负责，因会员在平台或平台服务中传输、发布的信息内容而导致建设银行或其他第三方任何直接或间接损失的，会员应承担责任并赔偿建设银行或第三方因此遭受的全部损失。
                </p>
                <p>
                    第十四条 使用平台服务时，若会员未遵从协议条款或网站说明、页面中之操作提示、规则，则建设银行有权不予提供相关服务，且建设银行不承担任何赔偿责任。因会员原因导致的损失由会员自行承担；因会员的原因导致建设银行或第三方损失的，建设银行保留追索的权利，会员应承担责任并赔偿建设银行或第三方因此遭受的全部损失。
                </p>
                <p>
                    第十五条 在会员办理本协议项下相关事项所必需的情形下，会员同意并授权建设银行向建设银行集团成员（包括建设银行境内外全资子公司、控股子公司）、服务机构及其他建设银行认为必要的业务合作机构提供建设银行获取的会员信息，范围包括但不限于会员的身份信息、账户信息等。上述第三方将为处理本协议项下事务之目的接触并按照建设银行的业务需要使用会员信息。建设银行将向有关第三方明确其保护会员信息的职责并要求第三方承担相应保密义务。会员还同意建设银行从上述第三方获取会员在注册、使用第三方服务期间提供、形成的信息。
                </p>
                <p>
                    第十六条 会员对于其发布在平台网站和手机客户端（APP）的各类信息（但不包括会员的身份信息），均授予平台免费的许可使用权。建设银行有权对之以电子或书面等方式进行使用、复制、发行、修订、改写、发布、翻译、分发、执行和展示或制作其派生作品。本协议另有约定的除外。
                </p>
                <p>
                    第十七条 会员不得使用与平台正常业务无关的任何软硬件装置干预或试图干预平台的正常运作。
                </p>
                <p>
                    第十八条 会员不得对平台上的任何资料（会员自身发布的相关信息除外）作本平台撮合交易以外的商业性利用，包括但不限于在未经建设银行授权的情况下，复制平台上展示的任何资料并用于商业用途。
                </p>
                <p>
                    第十九条 建设银行将通过平台或其他适当渠道发布有关平台的各类规则、通知、公告及声明，会员应当经常浏览平台发布的各类规则、通知、公告及声明，以了解平台各类政策、规则、事项的变化。建设银行不再单独或个别地通知会员前述信息。但会员仍应及时更新个人通讯或联系方式，因会员未及时更新而导致通知不到、权利丧失、服务中断或终止等不利后果由会员承担。
                </p>



                <p>第四章  建设银行的主要权利和义务</p>



                <p>
                    第二十条 建设银行对服务中涉及的会员资料负有保密义务，但在下述情况下建设银行披露会员资料和业务数据，不视为违反保密义务：

                    1.本协议另有约定或事先获得会员的明确授权或应允；

                    2.根据有关的法律法规、监管规定要求；

                    3.按照相关政府主管部门或司法机关按法定程序的要求；

                    4.在紧急情况下，为维护社会公众的利益；

                    5.披露前已为公众所知悉；

                    6.为维护建设银行的合法权益。
                </p>
                <p>
                    第二十一条 建设银行有义务在现有条件下提高服务质量，确保为会员提供的服务顺利进行。平台因不可抗力（包括但不限于建设银行不能预见、不能避免并不能克服的战争、暴动、严重火灾、水灾、台风、地震、社会事件、政府行为、禁令、供电等客观情况）导致服务中断或其他缺陷的，建设银行免除全部责任。

                    因建设银行合理控制范围外的原因（包括但不限于因网站所具有的特殊性质而遭受的包括黑客攻击、电信部门技术调整导致的影响、政府管制而造成的暂时性关闭在内的任何影响网络正常运营的因素）造成的服务中断或其他缺陷，建设银行不承担责任，但将尽力减少因此而给会员造成的损失和影响。任何由于建设银行合理控制范围以外的原因而产生的任何交易或服务系统问题，包括但不限于资料、行情等信息传输或储存上的错误，资料泄露、丢失、被盗用或被篡改，建设银行网站或手机客户端（APP）响应延迟或未能履约等，对此可能造成的任何责任建设银行不予承担。
                </p>
                <p>
                    第二十二条 建设银行对自身发布的公告信息真实性负责。会员信息以及会员发布的需求/服务信息（包括但不限于公司名称、联系人及联络信息、需求/服务的描述和说明、相关图片、视频等）均由会员提供，会员依法应对其提供的任何信息承担全部责任。建设银行对此等信息的准确性、完整性、合法性、有效性或真实性均不承担相关责任。
                </p>
                <p>
                    第二十三条 平台仅提供会员需求撮合及与需求撮合相关的其他服务。会员应自行判断需求信息或服务信息的真实性、合法性、准确性、有效性及完整性，以及交易各方的履约能力。建设银行仅在用户许可的前提下提供相关服务，建设银行不会参与用户间的交易，亦不会介入用户间因交易而产生的法律关系及法律纠纷。
                </p>
                <p>
                    第二十四条 建设银行有权依据其内部业务规定及商业判断独立决定是否同意客户所申请事项（包括但不限于会员资格申请等）。建设银行有权自主排列会员在页面的展示位置。建设银行有权审查会员的注册资料及信息发布情况，如发现存在违反法律、协议和业务管理规则的情形，有权采取要求会员说明情况、删除信息、停止会员服务等必要措施，会员应予以配合。
                </p>
                <p>
                    第二十五条 对于会员在平台上的不当行为（包括但不限于违法违规、违反会员所做承诺或约定义务、违反平台规则等）或其它任何建设银行认为应当终止服务的情况，建设银行有权采取删除或屏蔽会员发布的信息、限制或终止全部或部分服务、解除协议、列入黑名单、网站公示、警告等一项或多项处理措施，并保留追究其法律责任的权利，会员有权提出异议。
                </p>
                <p>
                    第二十六条 会员合法权益受到损害的，建设银行在法律法规允许范围内，尽可能提供交易对方会员的真实名称、地址和有效联系方式。对交易各方发生的争议，在法律法规允许范围内建设银行有权依据争议任何一方的要求向相关单位提交系统记录作为证据。
                </p>
                <p>
                    第二十七条 建设银行有权在会员的计算机上设定或取用与平台服务相关的有关信息。
                </p>
                <p>
                    第二十八条 建设银行有权根据业务需要将本协议项下的全部或部分权利义务转让给其关联公司，发生此种情况时建设银行仅需提前以网站公告的形式通知会员即可。
                </p>



                <p>第五章  收费</p>


                <p>

                    第二十九条 会员因交易或使用平台服务而发生的所有应纳税赋以及费用全部由会员自行承担。
                </p>
                <p>
                    第三十条 建设银行根据服务项目或服务内容，将服务价格、优惠措施及其生效和终止日期、与价格相关的例外条款和限制性条款、咨询（投诉）的联系方式等信息通过建设银行网点、网站等渠道以公告的方式向会员明示。建设银行公告内容构成本协议不可分割的一部分，与本协议具有同等效力。会员应在充分知晓、理解有关公告内容后签署本协议。
                </p>
                <p>
                    第三十一条 建设银行有权向会员收取相关服务费用。如需收费，建设银行将按照对外公示的服务价目表收取。
                </p>
                <p>
                    第三十二条 在没有其他特殊说明或约定的情况下，根据平台规则或会员签署的协议，建设银行有权从会员账户（包括但不限于会员在建行开立的一般账户及其他结算账户）中自动扣除相关费用（包括但不限于服务费用、违约金、赔偿金等）。具体收费标准、收费方式以建行银行公示的服务价目表为准。
                </p>



                <p>第六章  其他</p>



                <p>
                    第三十三条 除本协议另有约定外，在任何情况下，建设银行对本协议所承担的违约赔偿责任总额不超过向该会员收取的该年度服务费用总额。
                </p>
                <p>
                    第三十四条 本协议适用中华人民共和国法律，为本协议之目的，中华人民共和国法律不包括香港特别行政区、澳门特别行政区及台湾地区法律。
                </p>
                <p>
                    第三十五条 会员和平台之间因本协议引起的任何争议，应通过协商解决；协商未达成一致意见的，向建设银行住所地人民法院提起诉讼。在诉讼期间，本协议不涉及争议部分的条款仍须履行。
                </p>



                <p>附件：授权委托书</p>

            </div>
        </div>
</template>

<script>
    export default {
        name: "essp-user-agreement",
        methods:{
            handleScroll () {
                if (this.$refs.agreement.scrollHeight === parseInt(this.$refs.agreement.clientHeight+this.$refs.agreement.scrollTop-1)
                ||this.$refs.agreement.scrollHeight === parseInt(this.$refs.agreement.clientHeight+this.$refs.agreement.scrollTop+1)
                ||this.$refs.agreement.scrollHeight === parseInt(this.$refs.agreement.clientHeight+this.$refs.agreement.scrollTop)) {
                    //当滚动条到底时,这里是触发内容
                    //异步请求数据,局部刷新dom
                    this.$emit("buttonIsShow",true)
                }
            },
        }
    }

</script>

<style lang="less" scoped>
    .user-agreement{
        overflow: auto;
        height:430px;
        padding: 0px 20px;
        text-align: justify;
        border: 2px solid #ebebeb;
        p,h3{
            margin-top: 30px;
        }
        .t-c{
            text-align: center;
        }
    }
    .user-agreement::-webkit-scrollbar-track {
        border-radius: 0;
        padding: 0;
        background-color: transparent;
    }
    .user-agreement::-webkit-scrollbar-thumb {
        border-radius: 6px;
        padding: 0;
        background-color: #e5e5e5;
    }
    .user-agreement::-webkit-scrollbar {
        width: 14px;
        height: 7px;
        background-color: #f7f7f7;
    }
</style>
